Библиотека/src/InformationRegisters/Закладки/Закладки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Закладки</name>
  <resources>
    <name>Страница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Книга</name>
    <type>
      <types>CatalogRef.Книги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЗакладки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Библиотека/src/InformationRegisters/Закладки/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)

	Если ЗначениеЗаполнено(ЭтотОбъект.Отбор.Книга.Значение)
		И ЗначениеЗаполнено(ЭтотОбъект.Отбор.Пользователь.Значение)
		И Не ЗначениеЗаполнено(ЭтотОбъект.Отбор.ИдентификаторЗакладки.Значение) Тогда

		ИдентификаторЗакладки = Строка(Новый УникальныйИдентификатор);
		ЭтотОбъект.Отбор.ИдентификаторЗакладки.Установить(ИдентификаторЗакладки);
		
		Для Каждого Строка Из ЭтотОбъект Цикл
			Если Не ЗначениеЗаполнено(Строка.ИдентификаторЗакладки) Тогда
				Строка.ИдентификаторЗакладки = ИдентификаторЗакладки;
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры
